"""
생일 입력후 한글 표시
개발 프로그램 : VSCode
작성자 : 박치원
이메일 : iptablecommandcode@gmail.com
"""
import sys

month = {'1':'해오름달','2':'시샘달','3':'물오름달','4':'잎새달','5':'푸른달','6':'누리달',
    '7':'견우직녀달','8':'타오름달','9':'열매달','10':'하늘연달','11':'마름달','12':'매듭달'}
date = {'1':'하루','2':'이틀','3':'사흘','4':'나흘','5':'닷새','6':'엿새','7':'이레',
    '8':'여드레','9':'아흐레','10':'열흘','11':'열하루','12':'열이틀','13':'열사흘',
    '14':'열나흘','15':'열닷새','16':'열엿새','17':'열이레','18':'열여드레','19':'열아흐레',
    '20':'스무날','21':'스물하루','22':'스물이틀','23':'스물사흘','24':'스물나흘',
    '25':'스물닷새','26':'스물엿새','27':'스물이레','28':'스물여드레','29':'스물아흐레',
    '30':'서른날','31':'그믐날'}

print("\n"*2)
Wait_Message = input('나의 우리말 생일프로그램입니다. \n Enter 키를 입력하시면 프로그램을 실행합니다.\n 종료하시려면 n를 입력하세요')

if Wait_Message == 'n':
    sys.exit()

going = 1
while going == 1:

    print("\n"*2)
    name = input('당신의 이름을 입력하십시오')

    print("\n"*2)
    usersmonth = str(int(input('당신의 태어난 달을 숫자 그대로 입력하십시오')))

    print("\n"*2)
    usersdate = str(int(input('당신의 태어난 날짜를 숫자 그대로 입력하십시오')))

    print("\n"*2)
    print('{}님의 우리말 생일은 <{} {}>입니다.'.format(name,month[usersmonth],date[usersdate]))

    print("\n"*3)
    input_value = input('계속하시려면 y를, 그만하시려면 n을 입력해주세요')
    
    check = 1
    while check == 1:
        if input_value == "y":
            going = 1
            check = 0
        if input_value == "n":
            going = 0
            check = 0
        else:
            input_value = input('잘못 입력 하셨습니다.\n계속하시려면 y를, 그만하시려면 n을 입력해주세요')